# MarbleColor1 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Marble..::..MarbleColor1 Property
Marble Class See Also
---
The property labeled "Stone Color" from the "Marble" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MarbleColor1 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MarbleColor1 As String
	Get
```

Visual C++
---
```text
public:
static property String^ MarbleColor1 {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
Marble Class
Autodesk.Revit.DB.Visual Namespace